## Customers Dataset Cleaning

In [1]:
### import libraries 

import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

pd.set_option('display.max_columns',None)

In [2]:
## import Customers Dataset

Data = pd.read_excel('/Users/inazawaelectronics/Desktop/Data-Analyst-Intern-Project/BUDGET SALES ANALYSIS/Data/AdventureWorks_Database.xlsx', sheet_name='Customers')
Data.head()

,CustomerKey,FirstName,LastName,FullName,BirthDate,MaritalStatus,Gender,YearlyIncome,TotalChildren,NumberChildrenAtHome,Education,Occupation,HouseOwnerFlag,NumberCarsOwned,AddressLine1,DateFirstPurchase,CommuteDistance
0,11000,Jon,Yang,"Yang, Jon",1966-04-08,M,M,90000,2,0,Bachelors,Professional,1,0,3761 N. 14th St,2014-01-22,1-2 Miles
1,11001,Eugene,Huang,"Huang, Eugene",1965-05-14,S,M,60000,3,3,Bachelors,Professional,0,1,2243 W St.,2014-01-18,0-1 Miles
2,11002,Ruben,Torres,"Torres, Ruben",1965-08-12,M,M,60000,3,3,Bachelors,Professional,1,1,5844 Linden Land,2014-01-10,2-5 Miles
3,11003,Christy,Zhu,"Zhu, Christy",1968-02-15,S,F,70000,0,0,Bachelors,Professional,0,1,1825 Village Pl.,2014-01-01,5-10 Miles
4,11004,Elizabeth,Johnson,"Johnson, Elizabeth",1968-08-08,S,F,80000,5,5,Bachelors,Professional,1,4,7553 Harness Circle,2014-01-26,1-2 Miles

In [3]:
### Identify the shape of the Dataset
Data.shape

(18484, 17)

In [4]:
#### identify the dataset columns 

Data.columns

Index(['CustomerKey', 'FirstName', 'LastName', 'FullName', 'BirthDate',
       'MaritalStatus', 'Gender', 'YearlyIncome', 'TotalChildren',
       'NumberChildrenAtHome', 'Education', 'Occupation', 'HouseOwnerFlag',
       'NumberCarsOwned', 'AddressLine1', 'DateFirstPurchase',
       'CommuteDistance'],
      dtype='object')

In [5]:
### find duplicate values

Data[Data.duplicated()]

Empty DataFrame
Columns: [CustomerKey, FirstName, LastName, FullName, BirthDate, MaritalStatus, Gender, YearlyIncome, TotalChildren, NumberChildrenAtHome, Education, Occupation, HouseOwnerFlag, NumberCarsOwned, AddressLine1, DateFirstPurchase, CommuteDistance]
Index: []

#### No duplicate values in this dataset

In [6]:
## find the NULL Values in this data set 

Data.isnull().sum()

CustomerKey               0
FirstName                 0
LastName                  0
FullName                  0
BirthDate                 0
MaritalStatus             0
Gender                    0
YearlyIncome              0
TotalChildren             0
NumberChildrenAtHome      0
Education                 0
Occupation                0
HouseOwnerFlag            0
NumberCarsOwned           0
AddressLine1              0
DateFirstPurchase       566
CommuteDistance           0
dtype: int64

In [14]:
# Group by relevant columns and fill missing dates with median of each group
Data['DateFirstPurchase'] = Data.groupby(['Occupation', 'Education'])['DateFirstPurchase'].transform(
    lambda x: x.fillna(x.median())
)

In [16]:
Data['DateFirstPurchase'].value_counts().sort_values(ascending=False)

2016-02-29    127
2016-06-01    109
2016-05-09     91
2016-04-15     88
2016-11-30     81
             ...
2014-11-29      1
2014-04-25      1
2014-02-17      1
2014-08-21      1
2015-05-04      1
Name: DateFirstPurchase, Length: 1078, dtype: int64

In [17]:
## Check null values after fill null values

Data.isnull().sum()

CustomerKey             0
FirstName               0
LastName                0
FullName                0
BirthDate               0
MaritalStatus           0
Gender                  0
YearlyIncome            0
TotalChildren           0
NumberChildrenAtHome    0
Education               0
Occupation              0
HouseOwnerFlag          0
NumberCarsOwned         0
AddressLine1            0
DateFirstPurchase       0
CommuteDistance         0
dtype: int64

In [18]:
Data.describe().T

,count,mean,std,min,25%,50%,75%,max
CustomerKey,18484.0,20241.500000,5336.015523,11000.0,15620.75,20241.5,24862.25,29483.0
YearlyIncome,18484.0,57305.777970,32285.841703,10000.0,30000.00,60000.0,70000.00,170000.0
TotalChildren,18484.0,1.844352,1.612408,0.0,0.00,2.0,3.00,5.0
NumberChildrenAtHome,18484.0,1.004058,1.522660,0.0,0.00,0.0,2.00,5.0
HouseOwnerFlag,18484.0,0.676369,0.467874,0.0,0.00,1.0,1.00,1.0
NumberCarsOwned,18484.0,1.502705,1.138394,0.0,1.00,2.0,2.00,4.0

In [19]:
Data.to_excel('Customers.xlsx', index= False)